#' ---
#' title: "Множественные сравнения"
#' author: "Юта Тамберг, Марина Варфоломеева"
#' ---
#' 
#' ## RStudio
#' 
#' настроить расположение окон можно войдя в меню Tools -> Global Options -> Pane layout
#' 
#' ## Полезные клавиатурные сокращения в RStudio
#' 
#' - `Ctrl + Shift + C` - закомментировать/раскомментировать выделенный фрагмент кода
#' 
#' - `Ctrl + Enter` - отправить строку из текстового редактора в консоль. #' 
#' - `Tab` или `Ctrl + Space` - посмотреть список автоподстановки. 
#' 
#' ## Как получить помощь
#' 
#' 1. поставить курсор на название функции и нажать `F1`
#' 2. Перед названием функции напечатать знак вопроса и выполнить эту строку
#' 3. Можно воспользоваться функцией `help()`
#' 
#' 
#' ## математические операции
#' 
2 + 2
1024 / 2
34 * 4
2 ^ 4
sqrt(27)
(10*(3-1))^-1

#' 
#' ## Переменные
#' 
#' Оператор присваивания это символ стрелочки `<-`. Он работает справа налево:
#' 
#' `куда_записывать <- что_записывать`
#' 
#' ### Как давать имена?
#' 
#' - Можно использовать только латинские буквы, цифры, нижнее подчеркивание и точку.

#' Создадим переменную `var_1` и присвоим ей значение `1000`:

var_1 <- 1000
var_1
var_2 <- var_1^(1/3)
(var_1 + 600) / var_2

#' 
#' ## Способы создания векторов
#' 
#' команда `с()` от английского concatentate - собрать, склеить. значения разделяются запятыми:
#' 
c(-2.5, 1, 40, 2, 3, 5, 31)

#' 
#' - Команда `rep` повторяет одно и то же значение сколько угодно раз
#' 
rep(-19, 4)

#' 
#' - Команда `seq` создает вектор, где значения следуют одно за другим без пропусков
#' 
seq(1:10) # от одного до 10

#' 
#' Почитайте хелп и создайте вектор чисел от -5 до 3 и с шагом 0.5
#' 
#' ## Pешение
#' 








#' 
#' Можно стоить **многоуровневые конструкции**
#' 
c(-9.3, 0, 2.17, rep(11, 3), -2, seq(51, 55, 2))

#' 
#' Векторы можно хранить в переменных для последующего использования
vect_num_1 <- -11:12 

#' 
#' ## Адресация внутри векторов
#' 
#' При помощи оператора `[]`
#' 
vect_num_1[1] # первый элемент в векторе vect_num
vect_num_1[10] # 10-й элемент
vect_num_1[22]

vect_num_1[3:5]

vect_num_1[c(2, 4, 6)] # возвращает 2-й, 4-й и 6-й элементы
vect_num_1[c(1, 10, 20)] # возвращает 1-й, 10-й и 20-й элементы

#' 
#' Можно добавить в вектор значение, создать новую или перезаписать старую переменную
#' 
vect_num_2 <- c(vect_num_1, 0, seq(6, 8, 0.5))
vect_num_1 <- c(vect_num_1, 100)

#' 
#' ## Операции в векторами
#' 
#' Узнаем количество значений:
#' 
length(vect_num_1)

#' 
#' Сумма всех элементов вектора
#' 
sum(vect_num_1)

#' 
#' Сумма разных векторов
#' 
sum(vect_num_1, vect_num_2)

#' 
#' Математические операции
#' 
vect_num_1 + 2
vect_num_1 * 2
vect_num_1 ^2

#' 
#' ## Другие типы данных в R
#' 
#' ### Текстовые данные
"это текст"
'это тоже текст'

season<-c("winter","spring","winter","winter","spring",
          "spring","summer","summer","summer")

#' ### Логические данные
#' 
TRUE # истина
FALSE # ложь

summer <- c(F, F, F, F, F, F, T, T, T)
summer

#' 
#' ## Как узнать тип данных в переменной?
#' 
class(vect_num_1)
str(vect_num_1)
class(season)
str(summer)

#' 
#' ## Пропущенные значения
#' 
#'  Вставим NA в какой-нибудь вектор
#' 
vector1 <- rep(1, 5)
vector2 <- c(NA, rep(1, 5))

#' 
#' Посмотреть, какие значения в векторе неопределены
#' 
is.na(vector1)
is.na(vector2)

#' 
#' Многие команды, при работе с пропущенными значениями, будут выводить результат NA:
#' 
sum(vector2)

#' 
#' ## Работа с внешними данными
#' 
#' Проверим, где мы сейчас находимся
#' 
getwd()

#' Как поменять?
#'  
#' Выберите в меню `Session -> Set working Directory... -> To Source File Location`
#' 
#' 
#' ## Импорт данных: csv
#' 
#' `read.table("имя файла", sep=";", header=T)`
#' Первый аргумент - имя файла, оно указывается в кавычках
#' `sep` указывает разделитель. По умолчанию это пробел или табуляция, но можно записать и другое значение
#' Аргумент `header` определяет судьбу названий столбцов. По умолчанию его значение FALSE. Чтобы названия были прочитаны и стали именами переменных, нужно указать TRUE.
#' 
TEMP <- read.table("data/1.2_temperature.csv", header=T)

#' 
#' Посмотрим на несколько начальных строк:
#' 
head(TEMP)

#' 
#' ## Индексация таблицы данных
#' 
#' ### Значок доллара `$`
#' `где_искать$что_искать` т.е. `название_массива$название_переменной`
#' 
TEMP$season

#' 
#' ### Квадратные скобки `x[i]`
#' `x` - имя массива где проводится поиск, 
#' `i` - что собственно мы ищем. 
#' 
TEMP[1]

#' 
#' Поиск значений переменной по условию
#' 
TEMP$temperature[TEMP$season == "spring"]

#' 
#' ## Фрагмент таблицы данных с помощью команды 'subset'. Отличие же заключается в том, что вместо вектора значений одной переменной, мы получаем маленький, но настоящий, массив данных.
#' 
#' Попробуйте сами получить фрагмент таблицы, включающий все данные относящиеся к кофе.
#' 
#' ## Решение
#' 
#' 




#' 
#' ## Установка пакетов
#' 
#' `install.packages("имя_пакета")`
#' 
#' Чтобы использовать пакет в текущей сессии, загружаем его из библиотеки#' 
#' `library(имя_пакета)`
#' 
#' ## Завершение работы
#' 
#' `q()`
#' 
#' чтобы сохранить сессию можно сразу написать
#' 
#` q("yes")
#' 
