#' ---
#' title: "Введение в R"
#' author: "Юта Тамберг, Марина Варфоломеева"
#' ---

#####################
# 
#   Перед началом работы
#
#####################
#' 
#' 1. Создайте папку R_course где будут храниться ВСЕ материалы.
#' 
#' В эту папку помещайте пожалуйста ВСЕ файлы со скриптами
#' 
#' 2. Внтури папки R_course создайте папку data
#' 
#' В нее помещайте все файлы с данными для анализа
#' 
#' 
#' Настройка порядка окон:
#' Tools -> Global Options -> Pane layout
#' 
#' 
#' 1. Чтобы выполнить всю строчку надо поставить курсор в любое место этой строки и нажать `Ctrl + Enter` 
#' 
#' 2. Чтобы выполнить фрагмент строчки, надо выделить его и нажать `Ctrl + Enter` 
#' 
#' 3. Чтобы выполнить несколько команд одну за другой, надо выделить несколько строк и нажать `Ctrl + Enter` 
#' 


?help


help("help")


# это комментарии, они не будут выполняться

#######################
#' ## R как калькулятор, математические операции
#' 

2 + 2

1024 / 2

34 * 4

2 ^ 4

sqrt(27)


(10*(3-1))^-1


#####################
#' ## Переменные
#' 
#' `куда_записывать <- что_записывать`
#' 
#' Давайте создадим переменную `tea_1` и присвоим ей значение `70`:


tea_1 <- 70


#' Чтобы увидеть содержимое переменной, достаточно позвать ее по имени:

tea_1



#' Допустим, за 10 минут чай в чашке остывает на 10 градусов. Какова будет его новая температура?


tea_2 <- tea_1 - 10


#' А на сколько градусов она уменьшится за 5 минут?


(tea_1 - tea_2) / 2



#######################
#' ## Способы создания векторов
#' 
#' 1. Команда `с()`
#' 
#' Мы обошли своих соседей, и шестеро из них пили чай. Мы измерили температуру и у них тоже, и теперь готовы создать более серьезную переменную

tea_temp <- c(70, 64, 40, 91, 80, 83, 58)

#' 
#' 2. Команда `rep`


rep(-19, 4)


#' 3. Команда `seq`


seq(1, 10) # от одного до 10


####################
# Задание
#
#' Почитайте help(seq) и самостоятельно создайте вектор чисел от -5 до 3 и с шагом 0.5
#' 
#' 
#' ## Pешение









#' Можно стоить **многоуровневые конструкции**



c(0, 2, rep(11, 5), -2, seq(51, 55, 2))





#' Векторы можно хранить в переменных для последующего использования



vector_1 <- seq(-11, 12, 1)
vector_2 <- rep(0, 20)




#' ## Адресация внутри векторов




tea_temp[1] # первый элемент в векторе температур 
vector_1[10] # 10-й элемент в векторе vector_1
vector_1[22]




#' Какой результат дадут команды:


vector_1[3:5]
vector_1[c(1, 10)]
vector_1[c(2, 4, 6)]



#' Что будет, если при обращении к вектору вы просто перечислили номера элементов через запятую?



vector_1[1, 3, 5]



#' Очень легко добавить в вектор значение, или объединить векторы. При этом не обязательно создавать новую переменную, можно и перезаписать старую. 


#' Допустим, мы измерили температуру в еще одной чашке. Наша выборка растет! Чтобы перезаписать переменную `tea_temp` нужно склеить старые значения с новыми и присвоить их переменной со старым именем:


tea_temp <- c(tea_temp, 88)



#' Узнаем количество значений:



length(vector_1)


#' Сумма всех элементов вектора


sum(vector_1)


#' Сумма разных векторов


sum(vector_1, vector_2)



#' Математические операции


vector_1 + 2
vector_1 * 2
vector_1 ^2


####################
#' ## Другие типы данных в R
#' 

#' ### Текстовые данные


"это текст"

#' Текстовые значения можно объединять:


season<-c("winter","spring","winter","winter","spring",
          "spring","summer","summer","summer")



#' ### Логические данные


TRUE # истина
FALSE # ложь


summer <- c(F, F, F, F, F, F, T, T, T)
summer

#' Что мы получим, выполнив такую команду:


winter <- season == "winter"


#' ## Как узнать тип данных в переменной?


str(vector_1)
str(season)
str(winter)


#' ## Пропущенные значения (NA)

#' Вставим NA (допустим, из унесенной чашки) в вектор температур:


tea_temp <- c(tea_temp, NA)


#' Посмотреть, какие значения в векторе неопределены можно командой


is.na(tea_temp)


#' Проверьте, есть ли пропущенные значения в векторе `vector_2`


#' Многие команды, при работе с пропущенными значениями, будут выводить результат NA:


sum(tea_temp)


#' Чтобы узнать, почему и как это исправить - посмотрите в `help("sum")`. 


sum(tea_temp, na.rm = TRUE)


#######################
#' ## Работа с внешними данными
#' 
#' На минутку сверните RStudio и удостоверьтесь, что у вас есть одна папка, в которой находятся файлы скриптов с расширением .R, и **внутри** - папка data содержащая таблицы данных.
#' 
#' 
#' ## Устанавливаем рабочую директорию
#' 
#' Проверим, где мы сейчас находимся


getwd()

#' Допустим, это не та папка, которая нужна.
#' 
#' Выберите в меню `Session -> Set working Directory... -> To Source File Location`



#' ## Импорт данных

#' Прочитаем файл с температурами "1.2_temperature.csv" находящийся в папке "data". Это вымышленные данные о температуре и типе напитков, обнаруженных нами в чашках наших коллег в течение года.


TEMP <- read.table("data/1.2_temperature.csv", header=T)


#' Посмотрим на несколько начальных строк:


head(TEMP)



#' ## Индексация таблицы данных
#' 
#' ### Значок доллара `$`
#' 
#' `где_искать$что_искать` т.е. `название_массива$название_переменной`


TEMP$season


#' ### Квадратные скобки `x[i]`
#' 
#' Чтобы найти все значения переменной, отвечающие какому-то условию, мы должны создать двухуровневую конструкцию. Например, нас интересует температура напитков весной.
#' 
#' Сначала сконструируем х: обратимся к переменной `TEMP$temperature`
#' 
#' Затем i: обратимся к переменной `TEMP$season` и укажем, что нас интересуют значения `TEMP$season == "spring"`


TEMP$temperature[TEMP$season == "spring"]



#' ## Фрагмент таблицы данных
#' 
#' Аналогичную операцию можно проделать с помощью команды 'subset'. Отличие же заключается в том, что вместо вектора значений одной переменной, мы получаем маленький, но настоящий, массив данных.
#' 
#' Попробуйте сами получить фрагмент таблицы, включающий все данные относящиеся к кофе.
#' 
#' ## Решение








#############################
#' ## Установка пакетов
#' 

#' `install.packages("имя_пакета")`
#' 
#' Чтобы использовать пакет в текущей сессии, загружаем его из библиотеки:
#' 
#' `library(имя_пакета)`
#' 
