#' ---
#' title: "Описательные статистики"
#' author: "Юта Тамберг, Марина Варфоломеева"
#' subtitle: "making sense of many measurements"
#' ---
#' 
#' Cвязка медиана + квантили; 5-number summary.
#' 
#' Симулируем данные измерения диаметров яблок.
#' 
set.seed(14)
apples <- rnorm(10, 8, 1) #Возьмем десять случайных
                          #значений из нормального распределения
apples <- round(apples,1) #Перезапишем вектор, округлив измерения
                          #до первого знака после запятой
apples

#' 
#' Чтобы получить медиану, мы должны ранжировать, или отсортировать, наш вектор по возрастанию:
sort(apples)

#' Проверим себя: 
#' 
median(apples)

#' 
#' Представим, что наше распределение пострадало от неаккуратности. 

apples2 <- c(apples, 68) #Создадим вектор с новым значением
sort(apples2)

median(apples2)

mean(apples)
mean(apples2)

#' Задание: рассчитать медиану выборки с недостающими измереними
#' 
#' Мы измеряем время, затраченное лягушкой на то, чтобы перепрыгнуть препятствие. В эксперименте участвовало 20 животных. 16 из них перепрыгнули препятствие меньше чем за 15 минут. Еще четырех лягушек мы не дождались. Смоделируем такие данные:
#' 
set.seed(11)
jump_time <- round(runif(16, 1, 14),1)

#Генерируем значения из однородного распределения (n = 16, min = 1, max = 14)

jump_time_sorted <- c(sort(jump_time), NA, NA, NA, NA)

#Сортируем вектор и добавляем 4 медлительных лягушек

jump_time_sorted

#' Какова медиана?
#' 
#' ## Решение
#' 





#' 
#' ## Квантили
#' 
#' Квантили делят распределение на четыре равные части, каждая из которых включает по 25% значений.
#' 
#' I квантиль отсекает как раз 25%.
#' II - 50%. Это ни что иное, как медиана.
#' III квантиль отсекает 75% значений. 
#' 
#' Определим их с помощью команды `quantile`
#' 
quantile(apples)

#' 
#' ## 5-number summary
#' 
summary(apples)
summary(apples2)

#' 
#' ## Персентили
#' 
#' Узнаем, например, какие значения отсекают 10% или 99% значений выборки
#' 
quantile(apples, probs = c(0.1, 0.99))

#' 
#' ## Боксплот: 5-number summary на графике
#' 
boxplot(apples)

#' ## Case study: диатомовые водоросли в желудках фильтраторов. Самостоятельная работа.
#' 
#' В файле `data\2.1_diatome_count.csv` даны количества диатомовых водорослей в желудках этих животных. Прочитаем эти данные и посмотрим на их структуру:
#' 
diatoms <- read.table("data/2.1_diatome_count.csv", 
                      header = T, sep = "")
head(diatoms)

#' 
#' Одна строчка в таблице соответствует одному животному, колонки - видам
#'  
#' Ваша задача дать комплексную характеристику всем трем выборкам и построить боксплоты.
#' 
#' 
#' ## Решение
#' 








#' 
#' ## Боксплоты в ggplot2
#' 
#' Измним формат данных
#' 
diatoms2 <- stack(diatoms)
#Новые переменные теперь называются values и ind. Переименуем:
names(diatoms2) <- c("count", "sp")
head(diatoms2)

#' Можно строить график:

library("ggplot2")
ggplot(data = diatoms2, aes(y = count, x = sp)) + geom_boxplot()

#' 
#' # Связка среднее + стандартное отклонение
#' 
#' ### Арифметическое среднее
#' 
#' Рассчитаем вручную и проверим:
#' 
mean_apple_diam <- sum(apples) / length(apples)
mean_apple_diam
round(mean_apple_diam,3) == round(mean(apples),3)

#' 
#' ## Меры разброса
#' 
#' ### Девиата (отклонение) - разность между значением вариаты (измерения) и средней:

raw.deviates <- c(apples - mean(apples))
raw.deviates


round(sum(raw.deviates))

#' ### среднее отклонение = Average Deviation
#' 
sum(abs(raw.deviates)) / length(apples)

#' ### сумма квадратов = SS, Sum of Squares
#' 
sum((raw.deviates)^2)

#' ### Дисперсия = MS, Mean Square, Variance
#' 
sum((raw.deviates)^2) / length(apples)

#' 
#' ### Среднеквадратичное/стандартное отклонение = Standard Deviation
#' 
sqrt(sum((raw.deviates)^2) / length(apples))

#' 
#' ## Задания
#' 
#' ### 1. Из пяти положительных чисел создайте выборку со средней = 10 и медианой = 7
#' 
#' ### 2. Из чисел от 0 до 20 (можно с повторами) создайте две выборки: с минимальным и максимальным стандартным отклонением. Объем выборки тот же, 5 значений.
#' 
#' 
#' ## Решение 1




#' ## Решение 2





#' ## Выборка и генеральная совокупность
#' 
#' Давайте проверим как работают степени свободы на примере.
#' 
#' Cоздадим простейшую выборку со следующими признаками:
sim.mean <- 100
sim.sd <- 2
sim.n <- 11

#' 
#' Сначала рассчитаем дисперсию и сумму квадратов
#' 
sim.var <- sim.sd^2
sim.ss <- sim.var * (sim.n - 1)

#' 
#' SD = 2 это маленький разброс, так что надо выбирать значения недалеко от среднего. Например, 101 - очень удобное число. Заполним ими нашу выборку почти до конца:
#' 
sim.sample <- rep(101,10)

#' 
#' Рассчитаем значение суммы квадратов для уже созданных нами "свободных" вариат:
#' 
free.ss <- (10) * ((101-100)^2)
free.ss

#' 
#' Из общей суммы квадратов вычтем уже имеющуюся:
#' 
determined.ss <- sim.ss - free.ss

#' 
#' Определим значение одиннадцатой девиаты, т.е. расстояние от среднего до последнего значения в выборке.
#' 
sqrt(determined.ss)

#' 
#' 10 предыдущих значений были больше среднего, значит последнее должно быть меньше, иначе выборка не уравновесится
#' 
last.value <- 100 - sqrt(determined.ss)
last.value

#' 
#' Добавим последнее, "детерминированное", значение к остальным:
#' 
sim.sample <- c(rep(101,10), last.value)
sim.sample

#' 
#' Можем теперь проверить себя:
#' 
round(mean(sim.sample))
round(sd(sim.sample))

#' 
#' ## Take home messages
#' 
#' > - Описательные статистики ходят только в связке.
#' > - Выбирая между медианой и средней, учитывайте природу данных.
