#' ---
#' title: "Тестирование статистических гипотез"
#' author: "Юта Тамберг, Марина Варфоломеева"
#' ---

###### Гипотезы: нулевая и альтернативная #########

#' Нулевая гипотеза формулируется как отсутствие различий между сравниваемыми объектами
#' Альтернативная гипотеза формулируется как присутствие различий и включает все частные случаи

#' У статистического теста 4 возможных исхода

#' В мире где нулевая гипотеза верна можно
#' - принять ее (верное решение),
#' - отвергнуть ее (и это будет ошибка). 

#' В мире нулевая гипотеза не верна можно
#' - принять ее (что ошибочно),
#' - отвергнуть ее (что верно).



#### Операции с распределениями #############

#' `r` = random number generation.


sample_1000 <- rnorm(1000, mu = 20, sd = 2)


#' ### `q` = quantile function.


qnorm(0.5, mean = 20, sd = 2)

qnorm(0.025, mean = 20, sd = 2)


#### ЗАДАНИЕ ###############

#' С помощью функции `qnorm` получите 5-number summary для распределения с параметрами $\mu$ = 3 и $\sigma$ = 5



#' ## Решение








#' ### `p` = probability distribution function

pnorm(20, mean = 20, sd = 2)

round(pnorm(c(0, 15, 20, 25, 40), 20, 2), 3)


#### Пример t-теста #################

#' Cоздадим две выборки длин ящериц из популяций Берлина и Саратова. В этих гипотетических выборках длины распределены нормально, средние отличаются

# Зерно для генератора случайных чисел для сопоставимости результатов
set.seed(456) 

# Создаем две выборки по 100 из нормального распределения с разными параметрами
Berlin <- rnorm(n = 100, mean = 130, sd = 5)

Saratov <- rnorm(n = 100, mean = 129, sd = 5)

city <- c(rep("B", 100), rep("S", 100))

# Сохраняем выборки в датафрейме для удобства
lizards <- data.frame(city = factor(city),
                        length = c(Berlin, Saratov))


#' ## Построим частотные распределения этих выборок


library(ggplot2) # Загрузим библиотеку
theme_set(theme_bw()) # Зададим тему


#' Сконструируем "скелет" графика


ggplot(lizards, aes(x = length)) + 
  geom_histogram()


#' ## Изменим ширину интервалов гистограммы


ggplot(lizards, aes(x = length)) + 
  geom_histogram(binwidth = 3)


#' ## Разделим столбцы гистограммы по признаку city и сохраним в новую переменную


gg_length <- ggplot(lizards, aes(x = length, fill = city)) + 
    geom_histogram(binwidth = 3, colour = "grey40", position = "dodge")

gg_length


#' ## Добавим подписи осей и заголовок


gg_length + 
  labs(x = "Length (cm)", 
       y = "Count", 
       title ="Length distribution of lizards", 
       fill = "City")


#' ### Наш график готов!


#________________________________________
#### Рассчет t-статистики вручную ##########
#
# ## Посчитаем средние для двух городов
# 
# Создадим два логических вектора
# 
# 
# from_b <- lizards$city == "B"
# from_s <- lizards$city == "S"
# 
#  
#  Рассчитаем средние
#  
# 
# mean_b <- mean(lizards$length[from_b])
# mean_s <- mean(lizards$length[from_s])
# mean_b
# mean_s
# 
# 
#  Посчитаем квадрат ошибки
# 
# 
# SE_b <- sd(lizards$length[from_b])^2 / sum(from_b)
# SE_s <- sd(lizards$length[from_s])^2 / sum(from_s)
# 
# 
#  Подставим значения в формулу t-статитстики
# 
# 
# t.value <- (mean_b - mean_s) / sqrt(SE_b + SE_s) 
# t.value
# 
#__________________________________________


#' ## Выполним t-тест в R

t_lizards <- t.test(data = lizards, length ~ city)

# length ~ city показывает, что значения переменной
# length сгруппированы по признаку city
# Порядок записи важен!


t_lizards


str(t_lizards)


#` значение t-статистики

t_value_lizards <- t_lizards$statistic
t_value_lizards


#` значение p

p_value_lizards <- t_lizards$p.value
p_value_lizards


#' ## Достоверны ли различия?
#' 
#' Рассчитаем "табличное" значение t-критерия с помощью функции `qt()`
#' 
#' - так как критерий двухсторонний, мы должны разбить 5% на два кусочка по 2.5%, т.е. `p = c(0.025, 0.975)`
#' - число степенией свободы $n_1 + n_2 - 2$ равно `100 + 100 - 2 = 198`

qt(p = c(0.025, 0.975), 198)


#' Теперь с этими критическими значениями можно сравнить эмпирический результат:


t_value_lizards

#' ## Достоверны ли различия? Сравним вероятности
#' 
#' С помощью команды `pt()` определим вероятность того, что случайная величина, взятая из t-распределения, окажется меньше рассчитанной нами t-статистики `t.value`


pt(t.value, df = 198)

#' ### Это "сырая" величина. Её еще нельзя сравнивать с уровнем значимости.
#' 
#' Исходно мы проводили двусторонний тест, и задали общий уровень значимость 0.05 состоящий из равных половинок: 0.025 слева и 0.025 справа от нуля.
#' 
#' Мы должны либо умножить p.value на 2, либо поделить уровень значимости 0.05 пополам, и только после этого сравнивать их.
 

p.value <- 2 * pt(t.value, df = 198)
p.value

 

#' Вопрос: Какова разница между средними длинами в наших выборках?


#### ЗАДАНИЕ ####################

#' В пакете `boot` имеется датасет `aml`, содерщажий данные о влиянии регулярной химиотерапии на продолжительность ремиссии.

#' Прочитаем эти данные

library(boot)
rem <- aml
str(rem)


#' Внимательно прочитайте описание датасета и сравните продолжительность ремиссии у разных пациентов

help(aml)


#' Вам пригодится функция subset!

#' ## Решение















