# title: "Анализ мощности"
# author: Марина Варфоломеева

library(ggplot2)
library(grid)
library(gridExtra) # to rescale legend

###### Величина эффекта ####################################

# Условные уровни величины эффекта #########################


# Сильные, умеренные и слабые эффекты (Cohen, 1982)
library(pwr)
cohen.ES(test = "t", size = "large")

#### Задача 1------------------------------------------------

# Рассчитайте величину умеренных и слабых эффектов для
# t-критерия при помощи функции `cohen.ES()`





#### Задача 2------------------------------------------------

# Исследователи хотят проверить, что у крыс на богатой
# жирами диете ген "гормона голода" лептина будет
# даун-регулироваться в 5 раз.
# Т.е. ожидаемая разница логарифмов экспрессии между опытом
# и контролем будет примерно $log2(1) - log2(5) = -2.32$
# Стандартное отклонение этих различий по пилотным данным 1.2
# Рассчитайте величину эффекта
# Скажите, это будет слабый или сильный эффект?







#### Величина эффекта по данным пилотного исследования ######

##### Пример: Ремиссия рака и клеточная активность #########

# Представьте себе, что у нас есть результаты пилотного
# исследования. Мы хотим знать, различается ли уровень
# клеточной активности у пациентов в зависимости от того,
# наступила ли ремиссия. (Данные из кн. Freeman 1987).

library(readxl)
rem <- read_excel(path = "data/remission.xlsx", sheet = 1)
head(rem)
# Это данные о больных раком:
# - `LI` --- мера клеточной активности
# - `r` --- индикатор того наступила ли ремиссия (1 --- да, 0 --- нет)

#### Убедимся, что данные открылись правильно
str(rem)

rem$r <- factor(rem$r, levels = c(0, 1), labels = c("no", "yes"))

## Пропущенные значения
colSums(is.na(rem))
## Объем выборки
table(rem$r)


#### Задача 3------------------------------------------------

# Визуализируйте при помощи бокс-плотов различия клеточной
# активности в двух группах пациентов.
# Используйте геом `geom_boxplot()`
# Обозначьте группу при помощи заливки (эстетика `fill`).
# Подпишите оси при помощи элемента `labs()`



## Давайте теперь оценим величину эффекта
library(effsize)
effect <- cohen.d(rem$LI, rem$r)
effect


#### Задача 4  ----------------------------------------------

# Посмотрите на структуру объекта `effect`  при помощи
# функции `str()` и добудьте из него средствами R значение
# величины эффекта



#### Анализ мощности t-критерия в R ########################

# Давайте рассчитаем, какой будет нужен объем выборки, чтобы
# показать различия между группами с вероятностью 0.8 (т.е.
# чтобы мощность теста была 80%)
library(pwr)
pwr.t.test(n = NULL, d = effect$estimate, power = 0.8,
           sig.level = 0.05, type = "two.sample",
           alternative = "two.sided")


#### Задача 5------------------------------------------------

# Экстрагируйте из результатов `pwr.t.test()` величину
# объема выборки



#### Задача 6------------------------------------------------

# А если группы будут разного размера?
# Пациентов с ремиссией всего 5.
# Сколько нужно обследовать пациентов без ремиссии, чтобы
# обнаружить различия клеточной активности между группами?
# Используйте функцию `pwr.t2n.test`


#### Пример: Оксалат кальция в моче  ########################

# Данные анализа мочи. В некоторых пробах обнаружены
# кристаллы оксалата кальция. (Данные из сборника датасетов
# Andrews Herzberg 1985)
# Представим, что это данные пилотного исследования.
ur <- read_excel(path = "data/urine.xlsx", sheet = 1)
head(ur)
# - `r` --- индикатор присутствия кристаллов оксалата кальция
# - `calc` --- концентрация кальция

#### Убедимся, что данные открылись правильно
str(ur)

ur$r <- factor(ur$r, levels = c(0, 1),
               labels = c("absent", "present"))

## Пропущенные значения
colSums(is.na(ur))
## Объем выборки
table(ur$r)

#### Задача 7------------------------------------------------

# Постройте гистограмму распределения концентрации кальция.
# Заливкой обозначьте присутствие кристаллов оксалата
# кальция в пробе.



#### Задача 8------------------------------------------------

# Сколько нужно анализов, чтобы показать, что содержание
# кальция в этих пробах достоверно отличается при уровне
# значимости $\alpha = 0.001$?
# - При равном объеме выборок
# - Если будет только 16 проб с кристаллами оксалата кальция



#### Анализ мощности t-критерия при помощи симуляции #######

# При помощи простой симуляции можно проверить, будет ли
# достаточно 24 наблюдений в группе

# Сначала готовим данные

# средние значения из пилотного исследования
mu <- tapply(X = ur$calc, INDEX = ur$r, FUN = mean)

# обобщенное стандартное отклонение sigma в пилотном
# исследовании
ns <- table(ur$r)
var <- tapply(X = ur$calc, INDEX = ur$r, FUN = var)
sigma <- sqrt(((ns[1] - 1) * var[1] + (ns[2] - 1) * var[2])/(length(ur$r) - 2))

n <- 24 # проверяемое значение объема выборки
reps <- 1000 # число повторов в симуляции


#### ВАРИАНТ 1 - Используем цикл ###########################

pvals <- rep(NA, reps) # Место для результата
set.seed(42) # зерно генератора случайных чисел

# в цикле  многократно симулируем данные
for (i in 1:reps){
  # генерируем две случайные выборки
  # из нормального распределения
  x1 <- rnorm(n, mu[1], sigma)
  x2 <- rnorm(n, mu[2], sigma)
  # сравниваем их средние значения t-критерием
  t_res <- t.test(x = x1, y = x2)
  # добываем уровень значимости
  pvals[i] <- t_res$p.value
}
# Доля уровней значимости меньше критического уровня (здесь p < 0.001)
mean(pvals < 0.001)


#### ВАРИАНТ 2 - Используем `replicate()` ##################

# функция, генерирующая одну симуляцию
# n - объем выборки
my_sim <- function(n) {
  x1 <- rnorm(n, mu[1], sigma)
  x2 <- rnorm(n, mu[2], sigma)
  t_res <- t.test(x = x1, y = x2)
  return(t_res$p.value)
}
# my_sim(24) # пример употребления - одна симуляция

# Повторяем симуляцию 1000 раз
set.seed(42)
pvals <- replicate(1000, my_sim(24))
mean(pvals < 0.001)

#### Как проверить несколько возможных объемов выборки? ####

# Вариант 2 легче масштабируется.
# Достаточно дописать еще одну функцию, и мы сможем оценить
# мощность теста при разных объемах выборки.

# функция, возвращающая долю симуляций с p < 0.001
# x - объем выборки
my_sim_range <- function(x){
  pvals <- replicate(1000, my_sim(x))
  pw <- mean(pvals < 0.001)
  return(pw)
}

set.seed(42)
sapply(X = 20:25, FUN = my_sim_range)


#### Задание 9-----------------------------------------------

# По итогам предыдущей симуляции постройте кривую
# зависимости мощности от объема выборки (от 5 до 35)




#### Задание 10-----------------------------------------------

# При помощи симуляций проведите анализ мощности для данных
# о клеточной активности у больных раком
# Постройте кривую зависимости мощности теста от объема выборки




