# Оригинальные данные, представленные в пакете {ISwR}
# Измеряли вес и рост кормящих матерей и оценивали сколько молока высасывает ребенок.
#
# Вопрос:
#   Можно ли, зная рост матери, предсказать сколько молока высасывает их ребенок?
#
#
#
#
# Задание:
# 1. Проведите разведочный графический анализ данных. Оцените наличие выбросов и характер связи между переменными.
# 2. Постройте модель, описывающие связь количества высосанного молока, с ростом матери.
# 3. Визуализируйте полученную модель.

#
#
# Переменные
#
# dl.milk объем высосанного молока (dl/24h).
# sex пол ребенка.
# weight вес ребенка (kg).
# ml.suppl объем докорма (ml/24h).
# mat.weight вес матери (kg).
# mat.height рост матери (cm).
#


# имя файла "kfm.xls"

