# ## Упражнение по проверке условий применимости линейной
# регрессии ####
#
# Мутации у отцов и детей
#
# Kong, A., Frigge, M.L., Masson, G., Besenbacher, S.,
# Sulem, P., Magnusson, G., Gudjonsson, S.A., Sigurdsson,
# A., Jonasdottir, A., Jonasdottir, A. and Wong, W.S., 2012.
# Rate of de novo mutations and the importance of father/'s
# age to disease risk. Nature, 488(7412), pp.471-475.
#
# Конг с соавторами использовали полногеномное
# секвенирование, чтобы исследовать уровень передачи мутаций
# по наследству от родителей к детям (Kong  et al. 2012;
# источник данных Whitlock, Schluter 2009). Всего в
# исследовании приняли участие 78 семей. Мы проанализируем
# выборку, у всех детей в которой была диагностирована
# шизофрения (21 пара отец-ребенок). На этих данных мы
# оценим от возраста отца зависит число новых мутаций,
# которые они передали своим детям.
#
#
# Переменные:
# - Fage - возраст отца
# - Nmut - число унаследованных ребенком новых мутаций


#### Загрузка пакетов из библиотеки ####

library(readxl)
library(ggplot2)
library(car)

#### Знакомство с данными ####

# Не забудьте установить рабочую директорию или
# отредактируйте путь к файлу данных

# Открываем данные
mut <- read_excel("data/mutations_Kong_et_al_2012_lm_assumptions.xlsx", sheet = 1)

