# title: "Условия применимости линейной регрессии"
# author: Марина Варфоломеева, Вадим Хайтов

#### Диагностика линейных моделей ##########################

# Зачем нужна диагностика модели? Разве тестов было недостаточно?
dat <- read.table('data/orly_owl_Lin_4p_5_flat.txt')
fit <- lm(V1 ~ V2 + V3 + V4 + V5 - 1, data = dat)
coef(summary(fit))

#### Задание -----------------------------------------------

# Постройте график зависимости остатков от предсказанных
# значений при помощи этого кода
library(car)
residualPlot(fit, pch = ".")

#### Пример: Размеры сердца у котов ########################

# Как зависит размер сердца от размера тела у котов? (Fisher
# 1947; Venables, Ripley 1994)
# 97 котов (самцы) весом больше 2 кг
# Про каждого кота известно:
# - `Sex` --- пол
# - `Bwt` --- вес тела в кг
# - `Hwt` --- вес сердца в г

# Открываем данные
library(readxl)
cat <- read_excel("data/catsM.xlsx", sheet = 1)

# все правильно?
head(cat)
# str(cat)

# Пропущенные значения?
colSums(is.na(cat))

# Объем выборки
nrow(cat)

# Разброс значений предиктора и отклика
range(cat$Bwt)
range(cat$Hwt)

#### Задание -----------------------------------------------

# Постройте график зависимости веса сердца от веса тела.
# Сделайте так, чтобы точки были синего цвета ("blue" или
# "steelblue")
# Подберите уравнение линейной регрессии для этой зависимости.


### Проверка на влиятельные наблюдения  ####################

#### Вариант 1. График расстояния Кука. ####################

plot(cat_model, which = 4)


# 4/(N − k − 1)
cook_cutoff <- 4 / ((nrow(cat) - length(coef(cat_model)) - 2))
plot(cat_model, which = 4, cook.levels = cook_cutoff)


#### Вариант 2. График остатков с расстояниями Кука ########

# Данные для анализа остатков
library(ggplot2)
cat_diag <- fortify(cat_model)
head(cat_diag, 2)


#### Задание  ----------------------------------------------

# Используя данные из датафрейма `cat_diag`, постройте график
# зависимости стандартизированных остатков модели `cat_model`
# от предсказанных значений.

# Сделайте так, чтобы размер точек изменялся в зависимости
# от значения расстояния Кука.


#### Условия применимости линейной регрессии ###############

#### 1. Линейность связи ###################################

# - График зависимости $Y$ от $x$ (для множественной
# регрессии --- придется от всех $x$)
# - График остатков от предсказанных значений


# # 2. Независимость #######################################

# - остатки vs. предсказанные значения
# - остатки vs. переменные в модели
# - остатки vs. переменные не в модели

# ЧТо из этого мы можем построить для cat_model?



# # 3. Нормальное распределение ############################

# - квантильный график остатков.

qqPlot(cat_model) # из пакета car


#### 4. Постоянство дисперсии   ############################

# - график остатков

residualPlot(cat_model) # функция из пакета car


### Тренинг по анализу остатков ############################

# Выполните три блока кода
# Какие нарушения условий применимости линейных моделей
# здесь наблюдаются?

#### Задание, блок 1 ---------------------------------------

set.seed(90829)
x1 <- seq(1, 100, 1)
y1 <-  diffinv(rnorm(99))  + rnorm(100, 0.2, 4)
dat1 = data.frame(x1, y1)
ggplot(dat1, aes(x = x1, y = y1)) + geom_point()+
  geom_smooth(method="lm", alpha = 0.7)


#### Задание, блок 2   -------------------------------------

set.seed(7657674)
x2 <- runif(1000, 1, 100)
b_0 <- 100;  b_1 <- -20
h <- function(x) x^0.5
eps <- rnorm(1000, 0, h(x2))
y2 <- b_0 + b_1 * x2 + eps
dat2 <- data.frame(x2, y2)
ggplot(dat2, aes(x = x2, y = y2)) + geom_point() + geom_smooth(method = "lm")


#### Задание, блок 3 ---------------------------------------

set.seed(9283)
x3 <- rnorm(25, 50, 10)
b_0 <- 20; b_1 <- 20; eps <- rnorm(50, 0, 100)
y3 <- b_0 + b_1*x3 + eps
y3[100] <- 1000; x3[100] <- 95; y3[99] <- 1300; x3[99] <- 90; y3[98] <- 1500; x3[98] <- 80
dat3 <- data.frame(x3, y3)
ggplot(dat3, aes(x=x3, y=y3)) + geom_point() + geom_smooth(method="lm")

