# title: "Условия применимости линейной регрессии"
# author: Марина Варфоломеева, Вадим Хайтов


## Зачем нужна диагностика модели? Разве тестов было недостаточно? ####
dat <- read.table('data/orly_owl_Lin_4p_5_flat.txt')
fit <- lm(V1 ~ V2 + V3 + V4 + V5 - 1, data = dat)
coef(summary(fit))

## Задание--------------------------------------------------
# Постройте график зависимости остатков от предсказанных значений при помощи этого кода
library(car)
residualPlot(fit, pch = ".")




## Пример из прошлой лекции  ###############################

# Как зависит размер сердца от размера тела у котов? (Fisher 1947; Venables, Ripley 1994)
# 97 котов (самцы) весом больше 2 кг. Про каждого кота известно:
# - `Sex` --- пол
# - `Bwt` --- вес тела в кг
# - `Hwt` --- вес сердца в г

## Открываем данные
library(readxl)
cat <- read_excel("data/catsM.xlsx", sheet = 1)
## Линейная модель
cat_model <- lm(Hwt ~ Bwt, data = cat)
summary(cat_model)
## График линейной регрессии
library(ggplot2)
ggplot(cat, aes(x = Bwt, y = Hwt)) +
  geom_point() +
  geom_smooth(method = "lm")

### Анализ остатков  #######################################

# 1) Проверка на наличие влиятельных наблюдений
# 2) Проверка условий применимости линейных моделей
# - Линейная связь
# - Независимость
# - Нормальное распределение
# - Гомогенность дисерсий
# - Отсутствие коллинеарности предикторов (для можественной регрессии)

## Данные для анализа остатков #############################
cat_diag <- fortify(cat_model)
head(cat_diag, 2)

# График расстояния Кука (проверка на влиятельность) #######
ggplot(cat_diag, aes(x = 1:nrow(cat_diag), y = .cooksd)) +
  geom_bar(stat = "identity")

## График остатков от предсказанных значений ###############
gg_resid <- ggplot(data = cat_diag, aes(x = .fitted, y = .stdresid)) +
  geom_point() +
  geom_hline(yintercept = 0)
gg_resid

### Графики зависимости остатков от предикторов в модели ####
# Полный код
ggplot(data = cat_diag, aes(x =  Bwt, y = .stdresid)) +
  geom_point() + geom_hline(yintercept = 0)

# То же самое с использованием ранее созданного gg_resid
gg_resid + aes(x =  Bwt)

### Графики зависимости остатков от предикторов не в модели ####
# В данном случае их нет

## Квантильный график остатков #############################
library(car)
qqPlot(cat_model) # из пакета car



## Задание -------------------------------------------------

# Выполните три блока кода
# Какие нарушения условий применимости линейных моделей здесь наблюдаются?

# Для ответа вам понадобятся
# 1. График расстояния Кука
# 2. График остатков от предсказанных значений
# 3. Графики остатков от предикторов в модели и не в модели
# 4. Квантильный график остатков

## ----block-1-task------------------------------------------
set.seed(90829)
x1 <- seq(1, 100, 1)
y1 <-  diffinv(rnorm(99))  + rnorm(100, 0.2, 4)

dat1 <- data.frame(x1, y1)
ggplot(dat1, aes(x = x1, y =  y1)) +
  geom_point()+
  geom_smooth(method="lm", alpha = 0.7)


## ----block-2-task-----------------------------------------
  set.seed(7657674)
  x2 <- runif(1000, 1, 100)
  b_0 <- 100;  b_1 <- -20
  h <- function(x) x^0.5
  eps <- rnorm(1000, 0, h(x2))
  y2 <- b_0 + b_1 * x2 + eps

  dat2 <- data.frame(x2, y2)
  ggplot(dat2, aes(x = x2, y = y2)) +
    geom_point() +
    geom_smooth(method = "lm")


## ----block-3-task-----------------------------------------
set.seed(9283)
x3 <- rnorm(25, 50, 10)
b_0 <- 20; b_1 <- 20; eps <- rnorm(50, 0, 100)
y3 <- b_0 + b_1*x3 + eps
y3[100] <- 1000; x3[100] <- 95; y3[99] <- 1300; x3[99] <- 90; y3[98] <- 1500; x3[98] <- 80

dat3 <- data.frame(x3, y3)
ggplot(dat3, aes(x=x3, y=y3)) +
  geom_point() +
  geom_smooth(method="lm")


