# "Множественная линейная регрессия" Упражнение 3.

wt <- read.table("data/birthwt.csv", header = TRUE, sep = ";")

# Зависимая переменная  bwt – вес новорожденного в граммах
#
# Предикторы
#
# age – возраст матери
# lwt – вес матери при последней менструации.
# race – раса матери(1 = white, 2 = black, 3 = other).
# smoke – курение во время беременности
# ptl – количество преждевременных родов в анамнезе  (number of previous premature labours).
# ht – были ли случаи повышенного давления (history of hypertension).
# ui – присутствие маточной раздражимости (presence of uterine irritability).
# ftv – количество посещений врача в последний триместр (number of physician visits during the first trimester.)


# данные представлены в пакете {MASS}



# Задание:
# 1. Постройте модель, описывающую связь веса новорожденного с другими переменными
# 2. Проанализируйте валидность модели (при необходимости внести поправки)
