# title: "Множественная линейная регрессия"
# author: "Вадим Хайтов, Марина Варфоломеева"

# ## Пример: Опухоль простаты
# Можно ли судить о величине злокачественной опухоли простаты базируясь на знаниях клинических параметров? (Данные Stamey et al., 1989)
# Исследовано 97 пациентов, перенесших простатотомию.
#
# **Зависимая перменная**
# - `lpsa` --- логарифм концентрации простат-специфичного антигена
#
# **Предикторы**
# - `lcavol` --- логарифм объема опухоли
# - `lweight` --- логарифм веса
# - `age` --- возраст пациента
# - `lbph` --- логарифм степени доброкачественной гиперплазии
# - `svi` --- поражение семенных пузырьков
# - `lcp` --- логарифм меры поражения капсулы
# - `gleason` --- оценка по шкале Глисона
# - `pgg45` --- доля оценок 4 и 5 по шкале Глисона
# - `lpsa` --- логарифм концентрации простат-специфичного антигена
#
#
# Источник: Stamey, T.A., Kabalin, J.N., McNeal, J.E., Johnstone, I.M., Freiha, F., Redwine, E.A. and Yang, N. (1989) Prostate specific antigen in the diagnosis and treatment of adenocarcinoma of the prostate: II. radical prostatectomy treated patients, Journal of Urology 141(5), 1076–1083.-->

# ## Читаем данные #####
library(readxl)
prost <- read_excel("data/Prostate.xlsx")

# ## Проверяем, все ли правильно открылось
str(prost)

# Знакомство с данными #########################

# ## Есть ли пропущенные значения?
colSums(is.na(prost))

# Задание 1 #################################
# Постройте dotplot для всех переменных,
# оцените присутствие отскакивающих значений




scatterplotMatrix(prost[, -9])


# ## Задание 2 ######################################
# - Напишите код, который позволит рассчитать параметры линейной модели, описывающей зависимость lpsa от всех остальных величин (lcavol, lweight, age, lbph, svi, lcp, gleason, pgg45)


# # Проверка условий применимости модели ############

# ## Задание ########################################
# - Проверьте условия применимости модели
# ### 1) График расстояния Кука
# ### 2) График остатков от предсказанных значений
# ### 3) Графики остатков от предикторов в модели и нет
# ### 4) Квантильный график остатков


# ### Проверка на мультиколлинеарность

# Функция `vif()` из пакета `car`
vif(mod1)


# ## Удалим из модели избыточные предикторы
mod2 <- update(mod1, ~ . - lcp)
vif(mod2)
mod3 <- update(mod2, ~ . - pgg45)
vif(mod3)

# ## В этой модели осталось много незначимых предикторов
summary(mod3)

# ### Что дальше? ################################

# Два варианта действий:
# - Оставить все как есть. Если значение коэффициента при предикторе не  отличается значимо от нуля, значит, этот предиктор не влияет на объем опухоли. __ПРОВЕРЬТЕ ВЫПОЛНЕНИЕ УСЛОВИЙ ПРИМЕНИМОСТИ ДЛЯ ФИНАЛЬНОЙ МОДЕЛИ!__
# - Провести пошаговый подбор оптимальной модели (об этом позднее)

# Пока оставим все как есть и попытаемся выяснить, какие предикторы влияют сильнее всего

# # Сравнение вклада предикторов #################

# Коэффициенты при стандартизованных предикторах покажут, насколько сильно меняется отклик при изменении предиктора на одно стандартное отклонение.
# Для стандартизации используем функцию `scale()`

mod3_scaled <- lm(lpsa ~ scale(lcavol) + scale(lweight) + scale(age) + scale(lbph) + scale(svi) + scale(lcp) + scale(gleason) + scale(pgg45), data = prost)

# ## Какой из предиктов оказывает наиболее сильное влияние? {.smaller}
summary(mod3_scaled)


# ## Вопрос #######################################
# Какая доля суммарной дисперсии зависимой переменной описывается данной моделью?
