# Множественная регрессия. Упражнение 2.

# # Какие факторы определяют обилие птиц во фрагментированных лесных массивах Австралии?

# (Пример взят из книги Quinn&Keugh,2002; Оригинальная работа Loyn, 1987)
#
# Фрагментация лесных местообитаний - одна из важнейших проблем Австралии.
# Вопрос: от каких факторов зависит обилие птиц во фрагментированных лесных массивах?
#
# *Зависимая перменная*
# `ABUND` - Обилие птиц на стандартном маршруте
#
# *Предикторы*
# `AREA` - площадь лесного массива (Га)
# `YRISOL` - год, в котором произошла изоляция лесного массива
# `DIST` - расстояние до ближайшего другого лесного массива (км)
# `LDIST` - расстояние до ближайшего более крупного массива (км)
# `GRAZE` - качественная оценка уровня выпаса скота (1 - низкий уровень, 5 - высокий урвень)
# `ALT` - высота над уровнем моря (м)
#

# Загружаем пакеты из библиотеки ##################

library(car)
library(ggplot2)

# ## Читаем данные ################################
bird <- read.csv("data/loyn.csv")
head(bird)


# ## Знакомство с данными #########################

# Выбросы
gg_dot <- ggplot(bird, aes(y = 1:nrow(bird))) + geom_point()
gg_dot + aes(x = ABUND)
gg_dot + aes(x = AREA)
# Есть два леса огромной площади. Пока продолжим
gg_dot + aes(x = YRISOL)
gg_dot + aes(x = DIST)
# Один лес расположен очень далеко от других
gg_dot + aes(x = LDIST)
gg_dot + aes(x = GRAZE)
# На самом деле это дискретная переменная. В этом упражнении мы не будем обращать на это внимание, хотя так делать НЕПРАВИЛЬНО.
gg_dot + aes(x = ALT)
# Один высокогорный лес

# Итог: Подозрительные наблюдения есть. Возможно, они могут сильно повлиять на результат. Пока продолжим с ними

# Связи между переменными
scatterplotMatrix(bird)

# ## Явные проблемы
# ### Есть сильные корреляции между некоторым предикторами. Мы должны будем сделать проверку на мультиколлинеарность.

#### ВАРИАНТ 1. Анализ без взаимодействия факторов ########

# (взаимодействие в следующих сериях)

#### Постоим линейную модель ##############################
model <- lm(ABUND ~  AREA + YRISOL + DIST + LDIST + GRAZE + ALT, data = bird)

model <- lm(ABUND ~  . , data = bird)

summary(model)

# # Проверка условий применимости ###################

# 0) ПРОВЕРКА НА МУЛЬТИКОЛЛИНЕАРНОСТЬ

vif(model)
# Возможно GRAZE - лишний предиктор

model2 <- update(model, ~ . -GRAZE)
vif(model2)
# Мультиколлинеарности нет

# Теперь работаем с моделью 2

# Данные для графиков остатков
ABUND_diag <- fortify(model2)

# 1) График расстояния Кука
ggplot(ABUND_diag, aes(x = 1:nrow(ABUND_diag), y = .cooksd)) +
  geom_bar(stat = "identity")

# 2) График остатков от предсказанных значений
gg_resid <- ggplot(data = ABUND_diag, aes(x = .fitted, y = .stdresid)) +
  geom_point() + geom_hline(yintercept = 0)
gg_resid + geom_smooth(method = "loess")
gg_resid + geom_smooth(method = "lm")

# 3) Графики остатков от предикторов в модели и не в модели
# В модели: AREA + YRISOL + DIST + LDIST + ALT
# Не в модели  GRAZE
gg_resid + aes(x = AREA)
# Два лесных участка большой площади. Таких больших лесов мало, поэтому в этой области мы не можем оценить варьирование. На следующих графиках мы увидим похожие вещи.
gg_resid + aes(x = YRISOL)
gg_resid + aes(x = DIST)
gg_resid + aes(x = LDIST)
gg_resid + aes(x = ALT)

gg_resid + aes(x = factor(bird$GRAZE)) + geom_boxplot() #на грани допустимого. Прослеживается паттерн. Следовательно GRAZE важный фактор


# 4) Квантильный график остатков
qqPlot(model2)


#### Описываем результаты ##################################

summary(model2)

## Уравнение модели



# ## Сравним две модели
summary(model)$adj.r.squared
summary(model2)$adj.r.squared

# Удаление этого предиктора, скорее, ухудшает модель!
# И так будет всегда при удалении предикторов)))
# Почему удаление лишних предикторов может быть полезно -
# в следующей лекции

#### График модели  ########################################

# Множественную регрессию сложно изобразить на графике.
# Один из возможных вариантов -- это график отклика от важного предиктора, когда все другие предикторы принимают свои средние значения.

# Какой из предикторов самый важный?



#Рассмотрим самый важный предиктор
model2_scaled <- lm(ABUND ~ scale(AREA) + scale(YRISOL) + scale(DIST) + scale(LDIST) + scale(ALT), data = bird)

summary(model2_scaled) #Два самых важных предиктора

MyData <- data.frame(YRISOL = seq(min(bird$YRISOL), max(bird$YRISOL), 1), #Этот предиктор рассмотрим
                     AREA = mean(bird$AREA), #Остальные предикторы - средние
                     DIST = mean(bird$DIST),
                     LDIST = mean(bird$LDIST),
                     ALT = mean(bird$ALT) )


# предсказанные значения
Predictions <- predict(model2, newdata = MyData, se.fit = TRUE)
MyData$fit <- Predictions$fit

# стандартные ошибки
MyData$SE <- Predictions$se.fit

# доверительный интервал
MyData$upr <- MyData$fit + 1.96 * MyData$SE
MyData$lwr <- MyData$fit - 1.96 * MyData$SE

# График предсказаний модели
Pl_predict <- ggplot(MyData, aes(x = YRISOL, y = fit)) +
  geom_ribbon(alpha = 0.2, aes(ymin = lwr, ymax = upr)) +
  geom_line() +
  xlab("Bird abundance") +
  ylab("Year of forest isolation")

Pl_predict
# Нужно помнить, что этот  график --- это
# определенный "срез" всей модели. Это
# предсказанное моделью обилие птиц для лесов
# средней площади (AREA), на среднем расстоянии до
# ближайшего и до ближайшего большего леса (DIST и
# LDIST) и на средней высоте над уровнем моря
# (ALT).
# Т.е. это сферический конь в вакууме, в каком-то смысле

# Внимание, вопрос: имеет ли смысл на таком
# графике изображать исходные наблюдения? Обычно
# это делают, чтобы (1) посмотреть на величину
# остатков, (2) посмотреть на диапазон исходных наблюдений. Будет ли это иметь смысл здесь?
Pl_predict +
  geom_point(data = bird, aes(x = YRISOL, y = ABUND))

# Возможный вариант - добавить гребенку, изображающую исходные значения на осях X и Y.
Pl_predict +
  geom_rug(data = bird, aes(x = YRISOL, y = ABUND))

# Постройте самостоятельно график, отражающий связь с двумя предикторами

