## Множественная линейная регрессия --- подбор моделей ######

# Эти данные --- результаты ретроспективного исследования факторов, связанных с риском развития сердечно сосудистых заболеваний у мужчин. Исследование проведено в регионе с высокими рисками --- Вестерн Кейп, Южная Африка

# Выборка в этом файле неоднородна: у части мужчин было диагностировано заболевание коронарных сосудов. Многие из таких мужчин проходили терапию по снижению артериального давления уже после постановки диагноза. И в некоторых случаях измерения были сделаны уже после применения терапии.

# Эти данные взяты из большого датасета из работы Rousseauw et al, 1983 (опубликована в South African Medical Journal
# Rousseauw, J., du Plessis, J., Benade, A., Jordaan, P., Kotze, J. and Ferreira, J. (1983). Coronary risk factor screening in three rural communities, South African Medical Journal 64: 430–436.

# Переменные:
# sbp --- systolic blood pressure#
# tobacco --- cumulative tobacco (kg)
# ldl --- low density lipoprotein cholesterol
# adiposity --- a numeric vector
# famhist ---  family history of heart disease, a factor with levels Absent Present
# typea --- type-A behavior
# obesity --- a numeric vector
# alcohol --- current alcohol consumption
# age --- age at onset
# chd --- coronary heart disease


# Задача: -------------------------------------------------

# Давайте проанализируем, от каких факторов зависит артериальное давление (sbp).
# Возьмите данные только о здоровых мужчинах (у которых не было заболевания коронарных сосудов).
# Проанализируйте эти данные при помощи множественной линейной регрессии.
# Не используйте для построения регрессии в качестве предикторов дискретную переменную famhist (мы еще не научили вас с ними работать). Но обязательно обратите внимание на нее во время анализа остатков.


# Загружаем пакеты из библиотеки ##################

library(car)
library(ggplot2)

# ## Читаем данные ################################

# ## Фильтруем данные по условиям задачи ##########

# По условиям задачи нам нужно взять мужчин, у которых
# переменная chd не равна нулю, т.е. нет болезни
# коронарных артерий
filt <- SAheart$chd != 0
pressure <- SAheart[filt, -10]

