# Множественная регрессия. Упражнение 2.

# # Какие факторы определяют обилие птиц во фрагментированных лесных массивах Австралии?

# (Пример взят из книги Quinn&Keugh,2002; Оригинальная работа Loyn, 1987)
#
# Фрагментация лесных местообитаний - одна из важнейших проблем Австралии.
# Вопрос: от каких факторов зависит обилие птиц во фрагментированных лесных массивах?
#
# *Зависимая перменная*
# `ABUND` - Обилие птиц на стандартном маршруте
#
# *Предикторы*
# `AREA` - площадь лесного массива (Га)
# `YRISOL` - год, в котором произошла изоляция лесного массива
# `DIST` - расстояние до ближайшего другого лесного массива (км)
# `LDIST` - расстояние до ближайшего более крупного массива (км)
# `GRAZE` - качественная оценка уровня выпаса скота (1 - низкий уровень, 5 - высокий урвень)
# `ALT` - высота над уровнем моря (м)
#

# Загружаем пакеты из библиотеки ##################

library(car)
library(ggplot2)

# ## Читаем данные ################################
bird <- read.csv("data/loyn.csv")
head(bird)


# ## Знакомство с данными #########################

# Выбросы
gg_dot <- ggplot(bird, aes(y = 1:nrow(bird))) + geom_point()
gg_dot + aes(x = ABUND)
gg_dot + aes(x = AREA)
# Есть два леса огромной площади. Пока продолжим
gg_dot + aes(x = YRISOL)
gg_dot + aes(x = DIST)
# Один лес расположен очень далеко от других
gg_dot + aes(x = LDIST)
gg_dot + aes(x = GRAZE)
# На самом деле это дискретная переменная. В этом упражнении мы не будем обращать на это внимание, хотя так делать НЕПРАВИЛЬНО.
gg_dot + aes(x = ALT)
# Один высокогорный лес

# Итог: Подозрительные наблюдения есть. Возможно, они могут сильно повлиять на результат. Пока продолжим с ними

# Связи между переменными
scatterplotMatrix(bird)

# ## Явные проблемы
# ### Есть сильные корреляции между некоторым предикторами. Мы должны будем сделать проверку на мультиколлинеарность.

#### ВАРИАНТ 1. Анализ без взаимодействия факторов, и без подбора оптимальной модели ########

# (взаимодействие в следующих сериях)

#### Постоим линейную модель ##############################
model <- lm(ABUND ~  AREA + YRISOL + DIST + LDIST + GRAZE + ALT, data = bird)

model <- lm(ABUND ~  . , data = bird)

summary(model)

# # Проверка условий применимости ##########################

# 0) ПРОВЕРКА НА МУЛЬТИКОЛЛИНЕАРНОСТЬ

vif(model)
# Возможно GRAZE - лишний предиктор

model2 <- update(model, ~ . -GRAZE)
vif(model2)
# Мультиколлинеарности нет

# Теперь работаем с моделью 2

# Данные для графиков остатков
ABUND_diag <- fortify(model2)

# 1) График расстояния Кука
ggplot(ABUND_diag, aes(x = 1:nrow(ABUND_diag), y = .cooksd)) +
  geom_bar(stat = "identity")

# 2) График остатков от предсказанных значений
gg_resid <- ggplot(data = ABUND_diag, aes(x = .fitted, y = .stdresid)) +
  geom_point() + geom_hline(yintercept = 0)
gg_resid

# 3) Графики остатков от предикторов в модели и не в модели
# В модели: AREA + YRISOL + DIST + LDIST + GRAZE + ALT
gg_resid + aes(x = AREA)
# Два лесных участка большой площади. Таких больших лесов мало, поэтому в этой области мы не можем оценить варьирование. На следующих графиках мы увидим похожие вещи.
gg_resid + aes(x = YRISOL)
gg_resid + aes(x = DIST)
gg_resid + aes(x = LDIST)
gg_resid + aes(x = ALT)

# 4) Квантильный график остатков
qqPlot(model2)


#### Описываем результаты ##################################

summary(model2)


## Уравнение модели
# ???

# Доля объясненной изменчивости

#### График модели  ########################################

# Множественную регрессию сложно изобразить на графике.
# Один из возможных вариантов -- это график отклика от важного предиктора, когда все другие предикторы принимают свои средние значения.

#### ВАРИАНТ 2. Анализ, без взаимодействия факторов с подбором оптимальной модели ###############

# Способ 1. Частный F-критерий
drop1(model2, test = "F")
# Удаляем AREA
model3 <- update(model2, . ~ . - AREA)
drop1(model3, test = "F")
# Удаляем LDIST
model4 <- update(model3, . ~ . - LDIST)
drop1(model4, test = "F")

# Больше ничего удалить нельзя

# финальная модель model4
# ABUND ~ YRISOL + DIST + ALT

# Способ 2. Тесты соотношения правдоподобий

GLM2 <- glm(ABUND ~ AREA + YRISOL + DIST + LDIST + ALT, data = bird)

drop1(GLM2, test = "Chi")
# Удаляем AREA
GLM3 <- update(GLM2, . ~ . - AREA)
drop1(GLM3, test = "Chi")
# Удаляем LDIST
GLM4 <- update(GLM3, . ~ . - LDIST)
drop1(GLM4, test = "Chi")
# Больше ничего удалить нельзя

# финальная модель GLM4
# ABUND ~ YRISOL + DIST + ALT

# Способ 3. Информационные критерии (Один из)
AIC(GLM2, GLM3, GLM4)

# Финальная модель GLM3
# ABUND ~ YRISOL + DIST + LDIST + ALT

BIC(GLM2, GLM3, GLM4)
# финальная модель GLM4
# ABUND ~ YRISOL + DIST + ALT

#### Проверка условий применимости финальной модели ########

# Допустим, мы остановились на GLM4
# Данные для графиков остатков
GLM4_diag <- fortify(GLM4)
removed_before <- c("GRAZE")
removed_now <- c("AREA", "LDIST")
removed_vars <- c(removed_before, removed_now)
GLM4_diag_full <- data.frame(GLM4_diag, bird[, removed_vars])


# 1) График расстояния Кука
ggplot(GLM4_diag_full, aes(x = 1:nrow(GLM4_diag_full), y = .cooksd)) +
  geom_bar(stat = "identity")

# 2) График остатков от предсказанных значений
gg_resid <- ggplot(data = GLM4_diag_full, aes(x = .fitted, y = .stdresid)) +
  geom_point() + geom_hline(yintercept = 0)
gg_resid

# 3) Графики остатков от предикторов в модели и не в модели
# В модели: AREA + YRISOL + DIST + LDIST + GRAZE + ALT
gg_resid + aes(x = AREA)
# Два лесных участка большой площади. Таких
# больших лесов мало, поэтому в этой области мы не
# можем оценить варьирование. На некоторых
# следующих графиках мы увидим похожие вещи.
gg_resid + aes(x = YRISOL)
gg_resid + aes(x = DIST)
# Один лес очень далеко
gg_resid + aes(x = LDIST)
# Один лес очень далеко
gg_resid + aes(x = ALT)

# 4) Квантильный график остатков
qqPlot(model2)

# Итог: продолжим с этой оптимизированной моделью,
# хотя графики остатков убеждают нас, что лучше
# было бы удалить из анализа несколько
# наблюдений-выбросов.

#### График модели  ########################################

# Множественную регрессию сложно изобразить на графике.
# Один из возможных вариантов -- это график отклика от важного предиктора, когда все другие предикторы принимают свои средние значения.

#### ВАРИАНТ 3. Анализ с учетом взаимодействия факторов ###############


#### График модели  ########################################

# Множественную регрессию сложно изобразить на графике.
# Один из возможных вариантов -- это график отклика от важного предиктора, когда все другие предикторы принимают свои средние значения.
