# title: "Выбор моделей"
# author: Марина Варфоломеева, Вадим Хайтов
# ## Пример: рак предстательной железы
#
# От каких характеристик зависит концентрация простат-специфического антигена? (Stamey et al. 1989)
#
# Переменных много, мы хотим из них выбрать оптимальный небольшой набор
#
# 97 пациентов:
#
# - `lcavol` --- логарифм объема опухоли
# - `lweight` --- логарифм веса
# - `age` --- возраст пациента
# - `lbph` --- логарифм степени доброкачественной гиперплазии
# - `svi` --- поражение семенных пузырьков
# - `lcp` --- логарифм меры поражения капсулы
# - `gleason` --- оценка по шкале Глисона
# - `pgg45` --- доля оценок 4 и 5 по шкале Глисона
# - `lpsa` --- логарифм концентрации простат-специфичного антигена
#
# Источник: Stamey, T.A., Kabalin, J.N., McNeal, J.E., Johnstone, I.M., Freiha, F., Redwine, E.A. and Yang, N. (1989) Prostate specific antigen in the diagnosis and treatment of adenocarcinoma of the prostate: II. radical prostatectomy treated patients, Journal of Urology 141(5), 1076–1083.

# ## Модель из прошлой лекции ------------------------------
prost <- read_excel("data/Prostate.xlsx")
mod3 <- lm(lpsa ~ lcavol + lweight + age + lbph + svi + gleason, data = prost)


# ## Влияют ли предикторы?
summary(mod3)



#### Задание 1 ##########################################
# Для тренировки запишем вложенные модели для данной полной модели
# y_i = b_0 + b_1 x_1 + b_2 x_2 + b_3 x_3

# ## Решение

# Модели (пронумеруйте):

# Вложенность:





# # Частный F-критерий в R

summary(mod3)
# Незначимо влияние age, lbph, gleason. Можем попробовать оптимизировать модель

## Частный F-критерий, 1 способ: `anova(модель_1, модель_2)` #####

# Вручную выполняем все действия и выбираем, что можно выкинуть, и так много раз.

mod4 <- update(mod3, . ~ . - age)
anova(mod3, mod4)
mod5 <- update(mod4, . ~ . - lbph)
anova(mod3, mod5)
mod6 <- update(mod3, . ~ . - gleason)
anova(mod3, mod6)
# Удаляем gleason, и потом повторяем все снова...




# Но мы пойдем другим путем


##  Частный F-критерий, 2 способ: `drop1()` ################
# Можно протестировать все предикторы за один раз при помощи `drop1()`

drop1(mod3, test = "F")
# Нужно убрать gleason

mod4 <- update(mod3, . ~ . - gleason)
drop1(mod4, test = "F")
# Нужно убрать age

# Задание 2 ##################################################
# Продолжите дальше процедуру сравнения моделей сами





# ## Задание 3 ###############################################
# Проверьте финальную модель на выполнение условий применимости

# ### 1) График расстояния Кука
# ### 2) График остатков от предсказанных значений
# ### 3) Графики остатков от предикторов в модели и нет
# ### 3) Код для графиков остатков от предикторов в модели и нет
# ### 4) Квантильный график остатков


## Описываем финальную модель ##############################
summary(mod6)


### Тесты отношения правдоподобий ##########################

# Для подбора параметров методом максимального правдоподобия используют функцию `glm()`

# Симулированные данные
set.seed(9328)
dat <- data.frame(X = runif(n = 50, min = 0, max = 10))
dat$Y <- 3 + 15 * dat$X + rnorm(n = 50, mean = 0, sd = 1)

# Подбор модели двумя способами
Mod     <-  lm(Y ~ X, data = dat) # МНК
Mod_glm <- glm(Y ~ X, data = dat) # МЛ

# Одинаковые оценки коэффициентов
coefficients(Mod)
coefficients(Mod_glm)


# ## Логарифм правдоподобия
logLik(Mod_glm)

# ## Логарифм правдоподобия вручную -----------------------
# Предсказанные значения
dat$predicted <- predict(Mod)
# Оценка дисперсии
SD <- summary(Mod)$sigma
# Вероятности для каждой точки
dat$Prob <- dnorm(dat$Y, mean = dat$predicted, sd = SD)
# Логарифм вероятностей
dat$LogProb <- log(dat$Prob)
# Логарифм произведения, равный сумме логарифмов
sum(dat$LogProb)



#### Тест отношения правдоподобий в R ######################

#### Задание 4 ##############################################
# Для этой полной модели
GLM1 <- glm(lpsa ~ lcavol + lweight + age + lbph + svi + gleason, data = prost)
# Подберите оптимальную модель при помощи тестов отношения правдоподобий
# Тест отношения правдоподобий можно сделать с помощью тех же функций, что и частный F-критерий:
# - по-одному `anova(mod3, mod2, test = "Chisq")`
# - все сразу `drop1(mod3, test = "Chisq")`



# Финальную модель обязательно снова нужно проверить на выполнение условий применимости.
# Сделайте проверку, если осталось время


#### Информационные критерии  ##############################

## Рассчитаем AIC для наших моделей

AIC(GLM1, GLM2, GLM3, GLM4)

# Какую модель нужно выбрать?


# Задание 5 ###############################################

## Рассчитайте BIC для наших моделей при помощи функции BIC()
# Какую модель нужно выбрать?


