## Упражнение. Модели с дискретными и непрерывными предикторами #######

# Как зависит масса кошачьего сердца от веса тела и пола животного

# Источник данных
# R. A. Fisher (1947) The analysis of covariance
# method for the relation between a part and the
# whole, Biometrics 3, 65–68.

# В таблице три переменных:
# Sex - пол
# Bwt - body weight, вес тела, кг
# Hwt - heart weight, вес сердца, г

## Задание

# Исследуйте данные о кошках чтобы выяснить, как
# вес сердца зависит
# - От веса тела
# - От пола

# Проверьте условия применимости этой модели
# Упростите модель, если это возможно
# Напишите уравнение
# Постройте график предсказаний модели


# Загружаем пакеты из библиотеки ##################

library(readxl)
library(car)
library(ggplot2)

# ## Читаем данные ################################
cat <- read_excel("data/cats.xlsx", sheet = 1)
head(cat)


# ## Знакомство с данными #########################

str(cat)
colSums(is.na(cat))
table(cat$Sex)

# Выбросы
ggplot(cat, aes(x = Hwt, y = 1:nrow(cat))) + geom_point()
ggplot(cat, aes(x = Bwt, y = 1:nrow(cat))) + geom_point()

#### ВАРИАНТ 1. без взаимодействия факторов ########

