# Модель со взаимодействием на примере данных о морфометрии ирисов ####

# Цветки трех близких видов ирисов (Iris versicolor, I.virginica, I.setosa) очень похожи. Но пропорции лепестков и чашелистиков немного различаются. Данные по морфометрии цветков ирисов взяты из знаменитого датасета, который приписывают Фишеру или Андерсону.
# В этом датасете записаны измерения 50 цветков каждого из этих трех видов ирисов.

# - Petal.Length --- длина лепестков
# - Petal.Width --- ширина лепестков
# - Sepal.Length --- длина чашелистиков
# - Sepal.Width --- ширина чашелистиков
# - Species --- вид ириса

# Задание #########
# Подберите линейную модель, чтобы описать как длина чашелистиков зависит от их ширины.
# Проверьте условия применимости этой модели
# Упростите модель, если это возможно
# Напишите общее уравнение и отдельные уравнения модели для разных групп дискретного фактора
# Постройте график предсказаний модели

library(readxl)
iris <- read_excel("data/iris.xlsx")


