# title: "Взаимодействие дискретных и непрерывных предикторов"
# author: Марина Варфоломеева, Вадим Хайтов

# ## Пример: Пуромицин
#
# Пуромицин - антибиотик пуронового ряда, ингибитор синтеза белков.
# Эти данные --- о том, как меняется активность фермента галактозил трансферазы под воздействием пуромицина (Treloar 1974). Измеряли скорость реакции в зависимости от концентрации субстрата на мембранах аппарата Гольджи из богатых мембранами фракций из печени крыс.
#
# - `conc` --- концентрация пуромицина
# - `rate` --- скорость химичемской реакции
# - `state` --- индикатор того, обработаны ли клетки пуромицином

library(readxl)
Puromycin <- read_excel("data/Puromycin.xlsx")
head(Puromycin)

# ## Знакомимся с данными ########################

sapply(Puromycin, class)

colSums(is.na(Puromycin))

nrow(Puromycin)

table(Puromycin$state)


# ## Задание 1 ###################################
# Постройте график зависимости скорости химической
# реакции от концентрации











#### Подбираем линейную модель ####################
Puromycin$lc <- log(Puromycin$conc)
M1 <- lm(rate ~ lc + state, data = Puromycin)
summary(M1)


# ## Проверяем выполнение условий применимости #####




# # График предсказаний линейной модели ##########

# Что не так с этим графиком? Это наша модель?
ggplot(Puromycin, aes(x = lc, y = rate, colour = state)) +
  geom_point() +
  geom_smooth(method = "lm")


# ## Задание 2 #####################################
# Постройте график предсказаний модели по этим данным
#
# ### Данные для графика
library(plyr)
NewData <- ddply(
  Puromycin, .variables = .(state), summarise,
  lc = seq(min(lc), max(lc), length = 100))

# предсказанные значения
Predictions <- predict(M1, newdata = NewData, se.fit = TRUE)
NewData$fit <- Predictions$fit

# стандартные ошибки
NewData$SE <- Predictions$se.fit

# доверительный интервал
NewData$upr <- NewData$fit + 1.96 * NewData$SE
NewData$lwr <- NewData$fit - 1.96 * NewData$SE

# Обратная трансформация предиктора
NewData$conc <- exp(NewData$lc)




# #  Модель со взаимодействием дискретного и непрерывного предикторов

M2 <- lm(rate ~ lc + state + lc:state, data = Puromycin)
coef(M2)


# ## Задание 3 ####################################
# Глядя на коэффициенты линейной модели запишите уравнения:
# - общее уравнение линейной модели
# - уравнения для каждого из уровней дискретного фактора

coef(M2)
ggplot(Puromycin, aes(x = lc, y = rate, colour = state)) + geom_point() + geom_smooth(method = "lm")


# ## Тестируем гомогенность углов наклона
# Это делается как обычно при выборе моделей: при помощи `anova()` или `drop1()`
M1 <- lm(rate ~ lc + state, data = Puromycin)
M2 <- lm(rate ~ lc + state + lc:state, data = Puromycin)

# anova(M1, M2, test="F")
drop1(M2, test = "F")


# ## Представляем результаты в виде таблицы

# ### Вариант 1. Последовательное тестирование (SS type I)
#
# Факторы тестируются в порядке включения в
# модель. Результат тестирования зависит от
# порядка включения.
anova(M2)
anova(lm(rate ~ state + lc + state:lc, data = Puromycin))

# ### Вариант 2. Иерархическое тестирование (SS type III)
#
# Каждый из факторов по отношению к модели только
# без него, но со всеми остальными. Нужно, если
# много факторов и выборки разного размера. Тогда
# результат не будет зависеть от порядка включения
# факторов в модель.

# library(car)
Anova(M2, type = 3)


## Пример: Токсичность нитрофена ##################
# Нитрофен --- гербицид, тератоген, мутаген.
# Сейчас он не используется в США (первый
# пестицид, использование которого было запрещено
# из-за тератогенных эффектов), но все еще
# используется в России. Эти данные --- данные
# эксперимента по оценке токсичности нитрофена на
# дафниях _Ceriodaphnia dubia_ (Bailer, Oris
# 1994).
#
# 50 дафний случайно разделили на 5 групп,
# посадили в емкости с разной концентрацией
# нитрофена, оценили число яиц трех
# последовательных генераций.
#
# - `conc` --- концентрация нитрофена
# - `total` --- суммарная плодовитость
# - `brood` --- номер выводка
# - `N` --- размер потомства в выводке

nit <- read_excel("data/nitrofen.xlsx", sheet = 1)
head(nit)

# ## Задание 4 ####################################
#
# - Исследуйте данные о токсичности нитрофена
# - Чтобы выяснить, как численность потомства дафний зависит от
#     + концентрации нитрофена
#     + от выводка
#     + взаимодействия концентрации нитрофена и выводка
#     + и от суммарной плодовитости дафнии
# - Проверьте условия применимости этой модели
# - Упростите модель, если это возможно
# - Напишите общее уравнение и отдельные уравнения модели для трех выводков
# - Постройте график предсказаний модели




# ## Описание модели #############################
#
# Подумайте, что означают эти коэффициенты
summary(nit_mod_2)

coef(nit_mod_2)
# Запишите
# Общее уравнение модели:
# Уравнения для каждого выводка:
# Для выводка 1

# Для выводка 2

# Для выводка 3


# ## Таблица дисперсионного анализа

# Из-за того, что у нас есть дискретный фактор с
# несколькими уровнями, за его влияние отвечают
# сразу несколько коэффициентов. Проверить влияние
# фактора целиком можно при помощи дисперсионного
# анализа. Он работает аналогично тому, как мы это
# видели для простой линейной регрессии.

Anova(nit_mod_2, type = 3)


# ## Графическое представление результатов #########
# Изобразим предсказанный размер потомства при разных концентрациях ниторофена и __при средней суммарной плодовитости__.

# ### Данные для графика
library(plyr)
# ряд значений концентрации один и тот же для
# каждого выводка, поэтому
NewData <- expand.grid(brood = unique(nit$brood),
                       conc = unique(nit$conc),
  # средние значения суммарной плодовитости для каждого выводка
                       total = mean(nit$total))
# предсказанные значения
Predictions <- predict(nit_mod_2, newdata = NewData, se.fit = TRUE)
NewData$fit <- Predictions$fit
# стандартные ошибки
NewData$SE <- Predictions$se.fit
# доверительный интервал
NewData$upr <- NewData$fit + 1.96 * NewData$SE
NewData$lwr <- NewData$fit - 1.96 * NewData$SE


### Задание 5 ####################################
# Постройте график предсказаний модели

