# title: "Взаимодействие дискретных и непрерывных предикторов"
# author: Марина Варфоломеева, Вадим Хайтов

# ## Пример: Пуромицин
#
# Пуромицин - антибиотик пуринового ряда, ингибитор синтеза белков.
# Эти данные --- о том, как меняется активность фермента галактозил трансферазы под воздействием пуромицина (Treloar 1974). Измеряли скорость реакции в зависимости от концентрации субстрата на мембранах аппарата Гольджи из богатых мембранами фракций из печени крыс.
#
# - `conc` --- концентрация пуромицина
# - `rate` --- скорость химической реакции
# - `state` --- индикатор того, обработаны ли клетки пуромицином
library(readxl)
Puromycin <- read_excel("data/Puromycin.xlsx")
head(Puromycin)

# ## Знакомимся с данными
sapply(Puromycin, class)
colSums(is.na(Puromycin))
nrow(Puromycin)

table(Puromycin$state, Puromycin$conc)
library(ggplot2)
ggplot(Puromycin, aes(x = state, y = conc)) + geom_boxplot()


# ## Задание #####################################
#
# Постройте график зависимости скорости химической реакции от концентрации



# ## Запись формулы линейной модели со взаимодействием в R
#
# `Response ~ Continuous + Categorical + Continuous : Categorical` (полная запись)
#
# `Response ~ Continuous * Categorical`(сокращенная запись)
#
# `Continuous : Categorical` --- Кодовое обозначение взаимодействия. Добавление взаимодействия непрерывного и дискретного факторов в модель означает, что возможен разный угол наклона прямых для разных групп.

# ## Подберем модель со взаимодействием
Puromycin$lc <- log(Puromycin$conc)

M1 <- lm(rate ~ lc + state + lc:state, data = Puromycin)

# M1 <- lm(rate ~ lc * state, data = Puromycin) # То же самое

summary(M1)





# ## Проверяем выполнение условий применимости


# ## Рисуем график предсказаний
# Что не так с этим графиком? Это наша модель?
ggplot(Puromycin, aes(x = lc, y = rate, colour = state)) +
  geom_point() +
  geom_smooth(method = "lm")



# ## Задание --------------------------------------
# Постройте график предсказаний модели по этим данным
#
# ### Данные для графика

library(plyr)
NewData <- ddply(
  Puromycin, .variables = .(state), summarise,
  lc = seq(min(lc), max(lc), length = 100))
# предсказанные значения
Predictions <- predict(M1, newdata = NewData, se.fit = TRUE)
NewData$fit <- Predictions$fit
# стандартные ошибки
NewData$SE <- Predictions$se.fit
# доверительный интервал
NewData$upr <- NewData$fit + 1.96 * NewData$SE
NewData$lwr <- NewData$fit - 1.96 * NewData$SE
# Обратная трансформация предиктора
NewData$conc <- exp(NewData$lc)



# ##  Задание ------------------------------------
# Запишите уравнение этой модели и уравнения для каждой группы
coef(M1)



# ## Тестируем гомогенность углов наклона
M2 <- lm(rate ~ lc + state, data = Puromycin)
# anova(M1, M2, test="F")
drop1(M1, test = "F")


# ## Представляем результаты в виде таблицы

# ### Вариант 1. Последовательное тестирование (SS type I)
M3 <- lm(rate ~ state + lc + state:lc, data = Puromycin)
# сравните
anova(M1)
anova(M3)

# ### Вариант 2. Иерархическое тестирование (SS type III)
library(car)
Anova(M1, type = 3)
# Anova(M3, type = 3) # сравните


# # Модель со взаимодействием на примере данных о весе новорожденных
# Как вес новорожденных зависит от возраста матери и того, курит ли она
# - `age` --- возраст матери
# - `lwt` --- вес матери до беременности
# - `race` --- раса (1-белые, 2-черные, 3-другие)
# - `smoke` --- курение во время беременности (1-да,2-нет)
# - `ptl` --- число предыдущих преждевременных родов
# - `ht` --- гипертензия
# - `ui` --- гипертонус матки
# - `ftv` --- число визитов к врачу в последний триместр
# - `bwt` --- вес новорожденного, г

wt <- read.table("data/birthwt.csv", header = TRUE, sep = ";")

# ## Задание -------------------------------------
# - Исследуйте данные о весе новорожденных
# - Постройте модель зависимости веса новорожденных от возраста матери и взаимодействия
# - Проверьте условия применимости этой модели
# - Упростите модель, если это возможно
# - Напишите общее уравнение и отдельные уравнения модели для групп по дискретному фактору
# - Постройте график предсказаний модели



# ## Сложные модели лучше по возможности изображать в виде графика
# ### Данные для графика
library(plyr)
# Диапазон возрастов разный для курящих и некурящих, поэтому
NewData <- ddply(
  .data = wt, .variables = .(smoke), .fun = summarise,
  age = seq(min(age), max(age), length = 100))

#
# Если ваша модель называлась wt_mod_2, то получится так:

# предсказанные значения
Predictions <- predict(wt_mod_2, newdata = NewData, se.fit = TRUE)
NewData$fit <- Predictions$fit
# стандартные ошибки
NewData$SE <- Predictions$se.fit
# доверительный интервал
NewData$upr <- NewData$fit + 1.96 * NewData$SE
NewData$lwr <- NewData$fit - 1.96 * NewData$SE

# ## Задание --------------------------------------
# Постройте график предсказаний модели
