# Проверка усвоенного
#
# Прочитайте данные из файла "fev.xls" и удалите строки, в которых есть пропущенные значения


library(readxl)

fev <- read_excel("data/fev.xls", sheet = "tidy_data", skip = 1, na = "NA")
fev <- fev[complete.cases(fev), ]
fev$Sex <- factor(fev$Sex)
fev$Smoker <- factor(fev$Smoker)


# Задание1
# Определите значение 3-го квартиля для переменной Height для девочек
##########################

# Задание 2
# Чему равно среднее значение роста мальчиков в данной выборке?
##########################



# Задание 3
# Чему равна стандартная ошибка среднего для роста мальчиков в данной выборке?
##########################




# Задание 4.
# Сравните с помощью t-критерия рост мальчиков и девочек. Чему равно значение t-критерия? Значимы ли различия?
##########################




# Задание 5.
# Перед вами ряд значений уровня значимости, которые получены в результате множественного сравнения выборок с помощью t-критерия. Сколько из них говорят о достоверных различиях, если в качестве порога достоверности взят уровень значимости 0.05? Используйте поправку Бонферрони
###############

c(0.039046442, 0.007168042, 0.043416246, 0.005906894, 0.004664741, 0.037094342, 0.019788120)




# Задание 6.
# Постройте график, который вы найдете в файле picture.jpg
##########################






# Задание 7. Постройте линейную модель, описывающую зависимость роста от возраста и пола с учетом взаимодействия между этими предикторами
# Какую долю суммарной дисперсии описывает эта модель?
# Значимо ли влияние взаимодействия возраста и пола на рост?
# Чему равен AIC полной модели?
# Чему будет равен AIC, если выкинуть из модели взаимодействие предикторов?
# Чему равен предсказанный полной моделью рост у мальчиков при возрасте в 15 лет?
##########################


# Задание 8.
# Постройте линейную модель, описывающую связь между объемом легких (FEV) со всеми остальными перменными  без учета взаимодействия между предикторами. Какие три условия применения множественной регрессии здесь будут нарушены?



# Задание 9.
# Постройте линейную модель, описывающую связь между объемом легких (FEV) и переменными Smoker и Sexб без учета взаимодействия. Какое значение предикторов взято в качестве базового уровня?



# Задание 10.
# Измените в предыдущей модели базовый уровень, приняв в качестве него «Kурящих мальчиков». Запишите уравнение этой модели.


