## Межиндивидуальная изменчивость #######

# Как зависит скорость реакции от количества дней
# с ограничением сна

# Источник данных
# G. Belenky et al. (2003) Patterns of performance
# degradation and restoration during sleep
# restriction and subsequent recovery: a sleep
# dose-response study. Journal of Sleep Research
# 12, 1–12.

# В исследовании участвовало 18 человек, оно
# продолжалось 10 дней. В день 0 сон участников не
# был ограничен. Начиная с этой ночи время сна
# составляло всего 3 часа. Наблюдения представляют
# среднее время реакции в серии тестов.

# В таблице 180 наблюдений по трем переменным:
# Reaction - среднее время реакции, мс
# Days - число дней с ограничением сна
# Subject - подяковый номер участника исследования


## Задание

# Исследуйте данные чтобы выяснить, как
# время реакции зависит от
# - числа дней без сна
# - от личных особенностей участников

# Как каждый из участников реагировал на недостаток сна?

# Проверьте условия применимости моделей


# Загружаем пакеты из библиотеки ##################
library(readxl)
library(ggplot2)
library(car)

# ## Читаем данные ################################
sleepstudy <- read_excel("data/sleepstudy.xlsx")
head(sleepstudy)


# ## Знакомство с данными #########################

str(sleepstudy)

colSums(is.na(sleepstudy))
# Пропущенных значений нет
table(sleepstudy$Subject)
# Каждого субъекта наблюдали 10 дней

# Выбросы
ggplot(sleepstudy, aes(x = Reaction, y = 1:nrow(sleepstudy))) + geom_point()
# Выбросов нет

# Но на самом деле, когда мы смотрим на выбросы, хорошо бы учесть информацию о субъектах...

# Как меняется время реакции разных субъектов?
ggplot(sleepstudy, aes(x = Reaction, y = Subject)) + geom_point()
# Время реакции разных субъектов отличается, есть
# люди, время реакции у которых практически не
# меняется от недосыпа, и есть люди, которые
# страдают. Мы явно должны учесть
# межиндивидуальную изменчивость и использовать
# при моделировании фактор Subject.

# Да, еще, не известно, некоторых субъектов
# недосып может стимулировать? Добавим эстетику
# colour
ggplot(sleepstudy, aes(x = Reaction, y = Subject)) + geom_point(aes(colour = Days))
# Кажется, среди них есть наполеон - недосып его
# стимулирует.

# Как меняется время время реакции с
# продолжительностью хронического недосыпа?
ggplot(sleepstudy, aes(x = Reaction, y = Days)) + geom_point()
#

#### Неправильный анализ 1 - без учета межиндивидуальной изменчивости и без взаимодействия факторов ########

# Попробуем проигнорировать межиндивидуальную изменчивость...
mod_1 <- lm(Reaction ~ Days, sleepstudy)
summary(mod_1)

# Данные для графиков остатков
mod_1_diag <- fortify(mod_1)

# 1) График расстояния Кука
ggplot(mod_1_diag, aes(x = 1:nrow(mod_1_diag), y = .cooksd)) +
  geom_bar(stat = "identity")

# 2) График остатков от предсказанных значений
gg_resid <- ggplot(data = mod_1_diag, aes(x = .fitted, y = .stdresid)) +
  geom_point() + geom_hline(yintercept = 0)
gg_resid
# Гетерогенность дисперсии. Откуда она взялась, интересно...

# 3) Графики остатков от предикторов в модели и не в модели
gg_resid + aes(x = Days)
gg_resid + aes(x = sleepstudy$Subject)
# а лучше так:
ggplot(mod_1_diag, aes(x = sleepstudy$Subject, y = .stdresid)) +
  geom_boxplot()
# Выглядит ужасно. Игнорировать особенности участников нельзя



# 4) Квантильный график остатков
qqPlot(mod_1)
# Отклонения от нормального распределения


#### Неправильный анализ 2 - Включим Subject без взаимодействия ##############################

M0 <- lm(Reaction ~ Days + Subject, data = sleepstudy)
summary(M0)
# Смотрим в результаты
# нам пришлось использовать много коэффициентов.
# Эти новые коэффициенты - это коррекции для
# intercept в соответствии с индивидуальными
# особенностями участников. Одни из них в среднем
# быстро реагируют, другие медленно. После анализа
# остатков мы построим график и вы увидите, что
# это означает.

# Данные для графиков остатков
M0_diag <- fortify(M0)

# 1) График расстояния Кука
ggplot(M0_diag, aes(x = 1:nrow(mod_1_diag), y = .cooksd)) +
  geom_bar(stat = "identity")

# 2) График остатков от предсказанных значений
gg_resid <- ggplot(data = M0_diag, aes(x = .fitted, y = .stdresid)) +
  geom_point() + geom_hline(yintercept = 0)
gg_resid

#кажется связь не линейная

# 3) Графики остатков от предикторов в модели и не в модели
# В модели: Bwt Sex
gg_resid + aes(x = Days)

# график остатков похож на бантик: в первые и последние дни исследования дисперсия больше, чем в середине.

gg_resid + aes(x = sleepstudy$Subject)
# или
ggplot(M0_diag, aes(x = sleepstudy$Subject, y = .stdresid)) +
  geom_boxplot()
# Выглядит лучше! Но все равно

# 4) Квантильный график остатков
qqPlot(M0)
# Отклонения от нормального распределения


# График предсказаний этой модели

# Данные для графика. Поскольку всех субъектов
# исследовали в одни и те же дни, используем
# expand.grid, которая позволяет создать все
# уникальные сочетания
NewData <- expand.grid(Days = unique(sleepstudy$Days),
                       Subject = unique(sleepstudy$Subject))
# предсказанные значения
Predictions <- predict(M0, newdata = NewData, se.fit = TRUE)
NewData$fit <- Predictions$fit

# стандартные ошибки
NewData$SE <- Predictions$se.fit

# доверительный интервал
NewData$upr <- NewData$fit + 1.96 * NewData$SE
NewData$lwr <- NewData$fit - 1.96 * NewData$SE

# График
ggplot(NewData, aes(x = Days, y = fit)) +
  geom_ribbon(alpha = 0.2, aes(ymin = lwr, ymax = upr, group = Subject)) +
  geom_line(aes(colour = Subject)) +
  geom_point(data = sleepstudy, aes(x = Days, y = Reaction, colour = Subject))
# Вы видите на графике предсказаний параллельные линии.
# Наша модель не учитывала, что от хронической
# бессонницы у разных субъектов может менять ся
# по-разному время реакции.
# Но разумно ли это?

#### Более правильный анализ - Добавим взаимодействие факторов ##############

M1 <- lm(Reaction ~ Days * Subject, data = sleepstudy)
summary(M1)
# Смотрим в результаты
# нам пришлось использовать еще больше
# коэффициентов, чтобы смоделировать изменение
# угла наклона индивидуальных ответов.
Anova(M1)
# Взаимодействие достоверно - это значит, что
# изменение времени реакции от бессонницы у
# каждого человека приходит по-разному

# Значит, важны не столько стартовые личные
# особенности, сколько зависимость ответа каждого
# человека на продолжительность ограничения сна.

# Давайте проверим выполнение условий применимости
# Данные для графиков остатков
M1_diag <- fortify(M1)

# 1) График расстояния Кука
ggplot(M1_diag, aes(x = 1:nrow(M1_diag), y = .cooksd)) +
  geom_bar(stat = "identity")

# 2) График остатков от предсказанных значений
gg_resid1 <- ggplot(data = M1_diag, aes(x = .fitted, y = .stdresid)) +
  geom_point() + geom_hline(yintercept = 0)
gg_resid1

# нелинейность ушла, появились 3 значения с очень
# большими остатками

# 3) Графики остатков от предикторов в модели и не в модели
gg_resid1 + aes(x = Days)

# график остатков больше не похож на бантик!

gg_resid1 + aes(x = sleepstudy$Subject)
# или
ggplot(M1_diag, aes(x = sleepstudy$Subject, y = .stdresid)) +
  geom_boxplot()

# 4) Квантильный график остатков
qqPlot(M1)
# Отклонения от нормального распределения


# Правильным графическим представлением данных
# будет отдельная линия для каждого участника

ggplot(sleepstudy, aes(x = Days, y = Reaction, colour = Subject)) +
  geom_point() +
  geom_smooth(method = "lm")


# Для каждого испытуемого можно построить свою
# модель, но число наблюдений тогда будет слишком
# маленьким. Условия применимости будут часто
# нарушены.

#Нужен другой метод анализа. Нас на самом деле, не
#интересует межиндивидуальная изменчивость. На
#самом деле, нам хочется вычленить общие
#закономерности изменения времени реакции по дням.
# Это возможно сделать при помощи смешаных
# моделей, которые позволяют отказаться от
# моделирования индивидуальных регрессий при
# помощи кучи коэффициентов.

